In [1]:
%run helper/setup_notebook.ipynb import display_table

Successfully connected to leetcode50 database.

In [2]:
tables = ['Products', 'Orders']
for table in tables:
    display_table(table)

+------------+-----------------------+------------------+
| product_id |      product_name     | product_category |
+------------+-----------------------+------------------+
|     1      |   Leetcode Solutions  |       Book       |
|     2      | Jewels of Stringology |       Book       |
|     3      |           HP          |      Laptop      |
|     4      |         Lenovo        |      Laptop      |
|     5      |      Leetcode Kit     |     T-shirt      |
+------------+-----------------------+------------------+
+------------+------------+------+
| product_id | order_date | unit |
+------------+------------+------+
|     1      | 2020-02-05 |  60  |
|     1      | 2020-02-10 |  70  |
|     2      | 2020-01-18 |  30  |
|     2      | 2020-02-11 |  80  |
|     3      | 2020-02-17 |  2   |
|     3      | 2020-02-24 |  3   |
|     4      | 2020-03-01 |  20  |
|     4      | 2020-03-04 |  30  |
|     4      | 2020-03-04 |  60  |
|     5      | 2020-02-25 |  50  |
|     5      | 2020-02-27 |  50  |
|     5      | 2020-03-01 |  50  |
+------------+------------+------+

### Write an SQL query to get the names of products that have at least 100 units ordered in February 2020 and their amount.
```
+--------------------+---------+
| product_name       | unit    |
+--------------------+---------+
| Leetcode Solutions | 130     |
| Leetcode Kit       | 100     |
+--------------------+---------+
Explanation: 
Products with product_id = 1 is ordered in February a total of (60 + 70) = 130.
Products with product_id = 2 is ordered in February a total of 80.
Products with product_id = 3 is ordered in February a total of (2 + 3) = 5.
Products with product_id = 4 was not ordered in February 2020.
Products with product_id = 5 is ordered in February a total of (50 + 50) = 100.
```

In [3]:
%%sql 

SELECT 
    product_id, SUM(unit) AS unit
FROM Orders
GROUP BY product_id;

[(1, Decimal('130')),
 (2, Decimal('110')),
 (3, Decimal('5')),
 (4, Decimal('110')),
 (5, Decimal('150'))]

In [4]:
%%sql 

SELECT 
    product_name, 
    SUM(unit) AS unit
FROM Orders o
JOIN Products p ON o.product_id = p.product_id
GROUP BY product_name;

[('Leetcode Solutions', Decimal('130')),
 ('Jewels of Stringology', Decimal('110')),
 ('HP', Decimal('5')),
 ('Lenovo', Decimal('110')),
 ('Leetcode Kit', Decimal('150'))]

In [5]:
%%sql 

SELECT 
    product_name, 
    SUM(unit) AS unit
FROM Orders o
JOIN Products p ON o.product_id = p.product_id
GROUP BY product_name
HAVING SUM(unit) >= 100;

[('Leetcode Solutions', Decimal('130')),
 ('Jewels of Stringology', Decimal('110')),
 ('Lenovo', Decimal('110')),
 ('Leetcode Kit', Decimal('150'))]

In [6]:
%%sql 

SELECT 
    SUBSTR(order_date, 1, 7)
FROM Orders
LIMIT 3;

[('2020-02',), ('2020-02',), ('2020-01',)]

In [7]:
%%sql 

SELECT 
    product_name, 
    SUM(unit) AS unit
FROM Orders o
JOIN Products p ON o.product_id = p.product_id
WHERE SUBSTR(order_date, 1, 7) = '2020-02'
GROUP BY product_name
HAVING SUM(unit) >= 100;

[('Leetcode Solutions', Decimal('130')), ('Leetcode Kit', Decimal('100'))]

# Using Pandas

In [8]:
import pandas as pd

In [9]:
products_query = %sql SELECT * FROM Products # type: ignore
orders_query = %sql SELECT * FROM Orders # type: ignore

products_df = products_query.DataFrame()
orders_df = orders_query.DataFrame()

display(products_df, orders_df)

   product_id           product_name product_category
0           1     Leetcode Solutions             Book
1           2  Jewels of Stringology             Book
2           3                     HP           Laptop
3           4                 Lenovo           Laptop
4           5           Leetcode Kit          T-shirt

    product_id  order_date  unit
0            1  2020-02-05    60
1            1  2020-02-10    70
2            2  2020-01-18    30
3            2  2020-02-11    80
4            3  2020-02-17     2
5            3  2020-02-24     3
6            4  2020-03-01    20
7            4  2020-03-04    30
8            4  2020-03-04    60
9            5  2020-02-25    50
10           5  2020-02-27    50
11           5  2020-03-01    50

In [10]:
orders_df.merge(products_df, on='product_id')

    product_id  order_date  unit           product_name product_category
0            1  2020-02-05    60     Leetcode Solutions             Book
1            1  2020-02-10    70     Leetcode Solutions             Book
2            2  2020-01-18    30  Jewels of Stringology             Book
3            2  2020-02-11    80  Jewels of Stringology             Book
4            3  2020-02-17     2                     HP           Laptop
5            3  2020-02-24     3                     HP           Laptop
6            4  2020-03-01    20                 Lenovo           Laptop
7            4  2020-03-04    30                 Lenovo           Laptop
8            4  2020-03-04    60                 Lenovo           Laptop
9            5  2020-02-25    50           Leetcode Kit          T-shirt
10           5  2020-02-27    50           Leetcode Kit          T-shirt
11           5  2020-03-01    50           Leetcode Kit          T-shirt

In [11]:
merged_df = orders_df.merge(products_df, on='product_id')
merged_df

    product_id  order_date  unit           product_name product_category
0            1  2020-02-05    60     Leetcode Solutions             Book
1            1  2020-02-10    70     Leetcode Solutions             Book
2            2  2020-01-18    30  Jewels of Stringology             Book
3            2  2020-02-11    80  Jewels of Stringology             Book
4            3  2020-02-17     2                     HP           Laptop
5            3  2020-02-24     3                     HP           Laptop
6            4  2020-03-01    20                 Lenovo           Laptop
7            4  2020-03-04    30                 Lenovo           Laptop
8            4  2020-03-04    60                 Lenovo           Laptop
9            5  2020-02-25    50           Leetcode Kit          T-shirt
10           5  2020-02-27    50           Leetcode Kit          T-shirt
11           5  2020-03-01    50           Leetcode Kit          T-shirt

In [12]:
merged_df['order_date'].to_string()

'0     2020-02-05\n1     2020-02-10\n2     2020-01-18\n3     2020-02-11\n4     2020-02-17\n5     2020-02-24\n6     2020-03-01\n7     2020-03-04\n8     2020-03-04\n9     2020-02-25\n10    2020-02-27\n11    2020-03-01'

In [13]:
pd.DatetimeIndex(merged_df['order_date'])

DatetimeIndex(['2020-02-05', '2020-02-10', '2020-01-18', '2020-02-11',
               '2020-02-17', '2020-02-24', '2020-03-01', '2020-03-04',
               '2020-03-04', '2020-02-25', '2020-02-27', '2020-03-01'],
              dtype='datetime64[ns]', name='order_date', freq=None)

In [14]:
pd.DatetimeIndex(merged_df['order_date']).year

Index([2020, 2020, 2020, 2020, 2020, 2020, 2020, 2020, 2020, 2020, 2020, 2020], dtype='int32', name='order_date')

In [15]:
pd.DatetimeIndex(merged_df['order_date']).month

Index([2, 2, 1, 2, 2, 2, 3, 3, 3, 2, 2, 3], dtype='int32', name='order_date')

In [16]:
filtered_df = merged_df[(pd.DatetimeIndex(merged_df['order_date']).year == 2020) &
          (pd.DatetimeIndex(merged_df['order_date']).month == 2)]

filtered_df

    product_id  order_date  unit           product_name product_category
0            1  2020-02-05    60     Leetcode Solutions             Book
1            1  2020-02-10    70     Leetcode Solutions             Book
3            2  2020-02-11    80  Jewels of Stringology             Book
4            3  2020-02-17     2                     HP           Laptop
5            3  2020-02-24     3                     HP           Laptop
9            5  2020-02-25    50           Leetcode Kit          T-shirt
10           5  2020-02-27    50           Leetcode Kit          T-shirt

In [17]:
filtered_df.groupby('product_name').agg({'unit': 'sum'})

                       unit
product_name
HP                        5
Jewels of Stringology    80
Leetcode Kit            100
Leetcode Solutions      130

In [18]:
grouped_df = filtered_df.groupby('product_name').agg({'unit': 'sum'})
grouped_df

                       unit
product_name
HP                        5
Jewels of Stringology    80
Leetcode Kit            100
Leetcode Solutions      130

In [19]:
grouped_df.loc[grouped_df['unit'] >= 100]

                    unit
product_name
Leetcode Kit         100
Leetcode Solutions   130

In [20]:
final_df = grouped_df.query("unit >= 100").reset_index()
final_df

         product_name  unit
0        Leetcode Kit   100
1  Leetcode Solutions   130

In [21]:
final_df.sort_values('unit', ascending=False)

         product_name  unit
1  Leetcode Solutions   130
0        Leetcode Kit   100